Revit 2027 API
BuiltInFailures.KeyBasedTreeEntryFailures.CircularParentage Property
 A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularParentage { get; }
Public Shared ReadOnly Property CircularParentage As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularParentage {
	FailureDefinitionId^ get ();
}
static member CircularParentage : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace